package day0302;
// 자바의 명명규칙(Naming Convention)
// 1. 공통규칙
//    A. 이름에는 _를 제외한 특수문자는 사용할 수 없다.
//    B. 이름의 중간이나 맨 마지막에 숫자가 올 수도 있지만
//       숫자로 이름을 시작할 수는 없다.
//    C. 이제 한글로 이름을 지어줄 수 있긴 하지만
//       절대로 절대로 그러지 말자.
//    D. 자바에서는 내부적으로 실행할 명령어가 정의 된
//       50여가지의 키워드가 존재한다.
//       해당 키워들로는 이름을 지어줄 수 없기 때문에
//       내일 16시에 50여가지 적는 시험 보겠습니다.-> 구라임
//       이클립스에서는 해당 키워드를 자주색으로 표시해준다.
//       만약 여러분이 어떤 이름을 지어줬는데 자주색으로 표시될경우, 이름에 변형을 가해주거나
//       동의어를 사용해주면 된다.
// 2. 낙타등 표기법과 뱀 표기법
//    A. 낙타등 표기법(Camel Back Notation)
//       낙타등 표기법이란 이름이 여러 단어로 이루어져 있을 경우
//       두번째 단어부터는 단어의 첫글자를 대문자로 적는 방법이다.
//    B. 뱀 표기법(Snake Notation)
//       뱀 표기법이란 모든글자를 대문자로 적어주는 경우
//       단어의 사이마다 _를 넣어서 단어별 구분을 쉽게 해주는 방법이다.
// 3. 여러 가지 분류에 대한 이름 짓는 방법
//    A. 클래스(Class)
//       대문자로 시작하고 낙타등 표기법을 사용하는 명사
//    B. 패키지(Package)
//       소문자로 시작하고 낙타등 표기법을 사용하지만 모여있는 클래스들의 성격을
//       주로 한단어로만 표기하는 명사
//    C. 매소드(Method)
//       소문자로 시작하고 낙타등 표기법을 사용하는 동사
//       단, 프로그래밍의 규칙상 매소드는 반드시 이름 뒤에 ()가 붙는다.
//    D. 변수(Variable)
//       소문자로 시작하고 낙타등 표기법을 사용하는 명사
//    E. 상수(Constant)
//       뱀 표기법을 사용하는 명사
public class Ex02NamingConvention {
/*
 * 아래의 이름이 각각 무엇의 종류인지를 맞춰보시오.
 *  1. MemberController: 클래스
 *  2. memberController: 변수
 *  3. selectAll(): 매소드
 *  4. FILE_PATH: 상수
 */

}
