package day0302;
// 형변환(Type Casting)

// 형변환이란? 자료형을 다른 자료형으로 바꿔주는(=변환해주는) 것을 형변환이라고 한다.
// 형변환에는 암시적 형변화과 명시적 형변환 2가지가 있다.

// 1. 암시적 형변환(implicit type casting)
//    암시적 형변환은 데이터타입의 크기가 더 큰 공간에 데이터타입의 크기가 작은 값을 넣어주거나
//    실수형 공간에 정수형 값을 넣어줄 때 발생한다.
//    이때는 별다른 명령이 없이
//    공간 = 값; 만 하더라도 암시적 형변환이 발생하게 된다.



// 2. 명시적 형변환(explicit type casting)
//    명시적 형변환은 데이터타입의 크기가 더 작은 공간에 데이터타입의 크기가 큰 값을 넣어주거나
//    정수형 공간에 실수형 값을 넣어줄 때 발생한다.
//    이때는 우리가 데이터 손실이 일어나도 괜찮으니 형변환을 하라고 코드에 적어야한다.
//    방법은
//    공간 = (바꿀 데이터타입)값;
//    으로 적으면 된다.


public class Ex07TypeCasting {

}
