package day0323;

public class Ex02CarMain {

    public static void main(String[] args) {
        // Car 인터페이스를 상속받는
        // 페라리, BMW , 현대 클래스를 만들고
        // 사용자가 원하는 차량을 선택하면
        // 사용자가 그 차량의 메소드들을 다양하게 테스트 해볼 수 있는 프로그램을 작성하시오.
        // 단, 페라리, BMW , 현대 클래스의 경우
        // 메소드마다 특색있는 메시지가 출력되어야 합니다.
        
        // Car 인터페이스의 있어야 할 메소드들
        // 1. turnOn()
        // 2. speedUp()
        // 3. speedDown()
        // 4. goLeft()
        // 5. goRight()
        // 6. park()
        // 7. turnOff()
        
        // 각각의 클래스에 필요한 필드
        // 1. 차량번호("00가 0000")
        // 2. 모델명("소나타")
        // 3. 가격(3000) -> 3000만원을 의마하게 됨
        // 4. 색상("검정")
    }
}
